stenjo/dot-matrix-calendar/boards/CUSTOM_ESP32/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Custom ESP32 board"
#define MICROPY_HW_MCU_NAME "ESP32"


#define MICROPY_HW_SPI1_MOSI                (19)
#define MICROPY_HW_SPI1_MISO                (23)
#define MICROPY_HW_SPI1_SCK                 (18)
#define MICROPY_HW_SPI_HOST                 SPI1_HOST